overset_2cylinder/solution/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2112                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    inlet
    {
        type            patch;
        nFaces          70;
        startFace       60318;
    }
    outlet
    {
        type            patch;
        nFaces          70;
        startFace       60388;
    }
    topAndBottom
    {
        type            patch;
        nFaces          120;
        startFace       60458;
    }
    frontAndBack
    {
        type            empty;
        inGroups        1(empty);
        nFaces          60400;
        startFace       60578;
    }
    overSetPatch
    {
        type            overset;
        inGroups        1(overset);
        nFaces          160;
        startFace       120978;
    }
    walls
    {
        type            wall;
        inGroups        1(wall);
        nFaces          160;
        startFace       121138;
    }
)

// ************************************************************************* //
