overset_2cylinder/solution/constant/dynamicMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      dynamicMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dynamicFvMesh   dynamicOversetFvMesh;

motionSolverLibs (fvMotionSolvers);

//solver          displacementLaplacian;
solver          multiSolidBodyMotionSolver;

displacementLaplacianCoeffs
{
    diffusivity     uniform 1;
}

multiSolidBodyMotionSolverCoeffs
{
    cylinder1
    {
      // solidBodyMotionFunction oscillatingLinearMotion;
      //  oscillatingLinearMotionCoeffs
      //  {
      //      amplitude (0 -0.14 0);
      //      omega 1.04;
      //  }
      solidBodyMotionFunction linearMotion;
        linearMotionCoeffs
        {
            velocity        (0 -3 0);
        }
    }
    cylinder2
    {
      solidBodyMotionFunction linearMotion;
        linearMotionCoeffs
        {
            velocity        (0 3 0);
        }
    }
}
// ************************************************************************* //
